; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v7 - type_2 ?v6 - type_3)
 	      (pred_2 ?v2 - object ?v6 - type_3)
	      (pred_1 ?v7 - type_2 ?v8 - type_1)
	      (pred_4 ?v7 - type_2 ?v2 - object ?v8 - type_1))

   (:action op_3
       :parameters  (?v7 - type_2 ?v1 ?v3 - type_3)
       :precondition (and  (pred_3 ?v7 ?v1))
       :effect (and  (pred_3 ?v7 ?v3)
		     (not (pred_3 ?v7 ?v1))))

   (:action op_1
       :parameters (?v7 - type_2 ?v5 - object ?v4 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v4) (pred_3 ?v7 ?v4) (pred_1 ?v7 ?v8))
       :effect (and (pred_4 ?v7 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v4)) 
		    (not (pred_1 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_2 ?v5 - object ?v4 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v5 ?v8) (pred_3 ?v7 ?v4))
       :effect (and (pred_2 ?v5 ?v4)
		    (pred_1 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v5 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_04 obj_01 - type_2
obj_02 obj_05 obj_06 obj_03 - type_1
obj_07 obj_12 obj_11 obj_13 - type_3
obj_09 obj_08 obj_10 - object)
(:init
(pred_3 obj_04 obj_13)
(pred_1 obj_04 obj_02)
(pred_1 obj_04 obj_05)
(pred_3 obj_01 obj_07)
(pred_1 obj_01 obj_06)
(pred_1 obj_01 obj_03)
(pred_2 obj_09 obj_11)
(pred_2 obj_08 obj_11)
(pred_2 obj_10 obj_13)
)
(:goal
(and
(pred_2 obj_09 obj_13)
(pred_2 obj_08 obj_07)
(pred_2 obj_10 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_04 obj_11)))
)
)

; plan
1. (op_1 obj_04 obj_10 obj_13 obj_05)
   deleted: (pred_2 obj_10 obj_13) (pred_1 obj_04 obj_05)
   added: (pred_4 obj_04 obj_10 obj_05)
   goals met: 0 of 3
2. (op_3 obj_01 obj_07 obj_11)
   deleted: (pred_3 obj_01 obj_07)
   added: (pred_3 obj_01 obj_11)
   goals met: 0 of 3
3. (op_1 obj_01 obj_08 obj_11 obj_03)
   deleted: (pred_2 obj_08 obj_11) (pred_1 obj_01 obj_03)
   added: (pred_4 obj_01 obj_08 obj_03)
   goals met: 0 of 3
4. (op_3 obj_01 obj_11 obj_07)
   deleted: (pred_3 obj_01 obj_11)
   added: (pred_3 obj_01 obj_07)
   goals met: 0 of 3
5. (op_2 obj_01 obj_08 obj_07 obj_03)
   deleted: (pred_4 obj_01 obj_08 obj_03)
   added: (pred_2 obj_08 obj_07) (pred_1 obj_01 obj_03)
   goals met: 1 of 3
6. (op_3 obj_01 obj_07 obj_11)
   deleted: (pred_3 obj_01 obj_07)
   added: (pred_3 obj_01 obj_11)
   goals met: 1 of 3
7. (op_1 obj_01 obj_09 obj_11 obj_03)
   deleted: (pred_2 obj_09 obj_11) (pred_1 obj_01 obj_03)
   added: (pred_4 obj_01 obj_09 obj_03)
   goals met: 1 of 3
8. (op_3 obj_01 obj_11 obj_13)
   deleted: (pred_3 obj_01 obj_11)
   added: (pred_3 obj_01 obj_13)
   goals met: 1 of 3
9. (op_2 obj_01 obj_09 obj_13 obj_03)
   deleted: (pred_4 obj_01 obj_09 obj_03)
   added: (pred_2 obj_09 obj_13) (pred_1 obj_01 obj_03)
   goals met: 2 of 3
10. (op_2 obj_04 obj_10 obj_13 obj_05)
   deleted: (pred_4 obj_04 obj_10 obj_05)
   added: (pred_2 obj_10 obj_13) (pred_1 obj_04 obj_05)
   goals met: 2 of 3
11. (op_1 obj_01 obj_10 obj_13 obj_03)
   deleted: (pred_2 obj_10 obj_13) (pred_1 obj_01 obj_03)
   added: (pred_4 obj_01 obj_10 obj_03)
   goals met: 2 of 3
12. (op_3 obj_01 obj_13 obj_11)
   deleted: (pred_3 obj_01 obj_13)
   added: (pred_3 obj_01 obj_11)
   goals met: 2 of 3
13. (op_2 obj_01 obj_10 obj_11 obj_03)
   deleted: (pred_4 obj_01 obj_10 obj_03)
   added: (pred_2 obj_10 obj_11) (pred_1 obj_01 obj_03)
   goals met: 3 of 3
